Neo-Du/Stm32F429IGT6_Learning/28_MPU9250/Drivers/BSP/eMPL/inv_mpu.c
#ifdef MPU6500
    /* MPU6500 shares 4kB of memory between the DMP and the FIFO. Since the
     * first 3kB are needed by the DMP, we'll use the last 1kB for the FIFO.
     */
    data[0] = BIT_FIFO_SIZE_1024 | 0x8;
    if (i2c_write (st.hw->addr, st.reg->accel_cfg2, 1, data))
	return -1;
#endif

    /* Set to invalid values to ensure no I2C writes are skipped. */
    st.chip_cfg.sensors = 0xFF;
    st.chip_cfg.gyro_fsr = 0xFF;
    st.chip_cfg.accel_fsr = 0xFF;
    st.chip_cfg.lpf = 0xFF;
    st.chip_cfg.sample_rate = 0xFFFF;
    st.chip_cfg.fifo_enable = 0xFF;
    st.chip_cfg.bypass_mode = 0xFF;
#ifdef AK89xx_SECONDARY
    st.chip_cfg.compass_sample_rate = 0xFFFF;
#endif
    /* mpu_set_sensors always preserves this setting. */
    st.chip_cfg.clk_src = INV_CLK_PLL;
    /* Handled in next call to mpu_set_bypass. */
    st.chip_cfg.active_low_int = 1;
    st.chip_cfg.latched_int = 0;
    st.chip_cfg.int_motion_only = 0;
    st.chip_cfg.lp_accel_mode = 0;
    memset (&st.chip_cfg.cache, 0, sizeof(st.chip_cfg.cache));
    st.chip_cfg.dmp_on = 0;
    st.chip_cfg.dmp_loaded = 0;
    st.chip_cfg.dmp_sample_rate = 0;

    if (mpu_set_gyro_fsr (2000))
	return -1;
    if (mpu_set_accel_fsr (2))
	return -1;
    if (mpu_set_lpf (42))
	return -1;
    if (mpu_set_sample_rate (50))
	return -1;
    if (mpu_configure_fifo (0))
	return -1;

#ifndef STM32F429IGT
    if (int_param)
	reg_int_cb (int_param);
#endif

#ifdef AK89xx_SECONDARY
    setup_compass ();
    if (mpu_set_compass_sample_rate (10))
	return -1;
#else
    /* Already disabled by setup_compass. */
    if (mpu_set_bypass(0))
        return -1;
#endif

    mpu_set_sensors (0);
    return 0;
}

/**
 *  @brief      Enter low-power accel-only mode.
 *  In low-power accel mode, the chip goes to sleep and only wakes up to sample
 *  the accelerometer at one of the following frequencies:
 *  \n MPU6050: 1.25Hz, 5Hz, 20Hz, 40Hz
 *  \n MPU6500: 1.25Hz, 2.5Hz, 5Hz, 10Hz, 20Hz, 40Hz, 80Hz, 160Hz, 320Hz, 640Hz
 *  \n If the requested rate is not one listed above, the device will be set to
 *  the next highest rate. Requesting a rate above the maximum supported
 *  frequency will result in an error.
 *  \n To select a fractional wake-up frequency, round down the value passed to
 *  @e rate.
 *  @param[in]  rate        Minimum sampling rate, or zero to disable LP
 *                          accel mode.
 *  @return     0 if successful.
 */
int mpu_lp_accel_mode (unsigned short rate)
{
    unsigned char tmp[2];

    if (rate > 40)
	return -1;

    if (!rate)
    {
	mpu_set_int_latched (0);
	tmp[0] = 0;
	tmp[1] = BIT_STBY_XYZG;
	if (i2c_write (st.hw->addr, st.reg->pwr_mgmt_1, 2, tmp))
	    return -1;
	st.chip_cfg.lp_accel_mode = 0;
	return 0;
    }
    /* For LP accel, we automatically configure the hardware to produce latched
     * interrupts. In LP accel mode, the hardware cycles into sleep mode before
     * it gets a chance to deassert the interrupt pin; therefore, we shift this
     * responsibility over to the MCU.
     *
     * Any register read will clear the interrupt.
     */
    mpu_set_int_latched (1);
#if defined MPU6050
    tmp[0] = BIT_LPA_CYCLE;
    if (rate == 1) {
        tmp[1] = INV_LPA_1_25HZ;
        mpu_set_lpf(5);
    } else if (rate <= 5) {
        tmp[1] = INV_LPA_5HZ;
        mpu_set_lpf(5);
    } else if (rate <= 20) {
        tmp[1] = INV_LPA_20HZ;
        mpu_set_lpf(10);
    } else {
        tmp[1] = INV_LPA_40HZ;
        mpu_set_lpf(20);
    }
    tmp[1] = (tmp[1] << 6) | BIT_STBY_XYZG;
    if (i2c_write(st.hw->addr, st.reg->pwr_mgmt_1, 2, tmp))
        return -1;
#elif defined MPU6500
    /* Set wake frequency. */
    if (rate == 1)
	tmp[0] = INV_LPA_1_25HZ;
    else if (rate == 2)
	tmp[0] = INV_LPA_2_5HZ;
    else if (rate <= 5)
	tmp[0] = INV_LPA_5HZ;
    else if (rate <= 10)
	tmp[0] = INV_LPA_10HZ;
    else if (rate <= 20)
	tmp[0] = INV_LPA_20HZ;
    else if (rate <= 40)
	tmp[0] = INV_LPA_40HZ;
    else if (rate <= 80)
	tmp[0] = INV_LPA_80HZ;
    else if (rate <= 160)
	tmp[0] = INV_LPA_160HZ;
    else if (rate <= 320)
	tmp[0] = INV_LPA_320HZ;
    else
	tmp[0] = INV_LPA_640HZ;
    if (i2c_write (st.hw->addr, st.reg->lp_accel_odr, 1, tmp))
	return -1;
    tmp[0] = BIT_LPA_CYCLE;
    if (i2c_write (st.hw->addr, st.reg->pwr_mgmt_1, 1, tmp))
	return -1;
#endif
    st.chip_cfg.sensors = INV_XYZ_ACCEL;
    st.chip_cfg.clk_src = 0;
    st.chip_cfg.lp_accel_mode = 1;
    mpu_configure_fifo (0);

    return 0;
}

/**
 *  @brief      Read raw gyro data directly from the registers.
 *  @param[out] data        Raw data in hardware units.
 *  @param[out] timestamp   Timestamp in milliseconds. Null if not needed.
 *  @return     0 if successful.
 */
int mpu_get_gyro_reg (short*data,unsigned long*timestamp)
{
    unsigned char tmp[6];

    if (!(st.chip_cfg.sensors & INV_XYZ_GYRO))
	return -1;

    if (i2c_read (st.hw->addr, st.reg->raw_gyro, 6, tmp))
	return -1;
    data[0] = (tmp[0] << 8) | tmp[1];
    data[1] = (tmp[2] << 8) | tmp[3];
    data[2] = (tmp[4] << 8) | tmp[5];
    if (timestamp)
	get_ms (timestamp);
    return 0;
}

/**
 *  @brief      Read raw accel data directly from the registers.
 *  @param[out] data        Raw data in hardware units.
 *  @param[out] timestamp   Timestamp in milliseconds. Null if not needed.
 *  @return     0 if successful.
 */
int mpu_get_accel_reg (short*data,unsigned long*timestamp)
{
    unsigned char tmp[6];

    if (!(st.chip_cfg.sensors & INV_XYZ_ACCEL))
	return -1;

    if (i2c_read (st.hw->addr, st.reg->raw_accel, 6, tmp))
	return -1;
    data[0] = (tmp[0] << 8) | tmp[1];
    data[1] = (tmp[2] << 8) | tmp[3];
    data[2] = (tmp[4] << 8) | tmp[5];
    if (timestamp)
	get_ms (timestamp);
    return 0;
}

/**
 *  @brief      Read temperature data directly from the registers.
 *  @param[out] data        Data in q16 format.
 *  @param[out] timestamp   Timestamp in milliseconds. Null if not needed.
 *  @return     0 if successful.
 */
int mpu_get_temperature (long*data,unsigned long*timestamp)
{
    unsigned char tmp[2];
    short raw;

    if (!(st.chip_cfg.sensors))
	return -1;

