Neo-Du/Stm32F429IGT6_Learning/28_MPU9250/Drivers/BSP/eMPL/inv_mpu.c
    if (i2c_read (st.hw->addr, st.reg->temp, 2, tmp))
	return -1;
    raw = (tmp[0] << 8) | tmp[1];
    if (timestamp)
	get_ms (timestamp);

    data[0] = (long) ((35 + ((raw - (float) st.hw->temp_offset) / st.hw->temp_sens)) * 65536L);
    return 0;
}

/**
 *  @brief      Read biases to the accel bias 6500 registers.
 *  This function reads from the MPU6500 accel offset cancellations registers.
 *  The format are G in +-8G format. The register is initialized with OTP
 *  factory trim values.
 *  @param[in]  accel_bias  returned structure with the accel bias
 *  @return     0 if successful.
 */
int mpu_read_6500_accel_bias (long*accel_bias)
{
    unsigned char data[6];
    if (i2c_read (st.hw->addr, 0x77, 2, &data[0]))
	return -1;
    if (i2c_read (st.hw->addr, 0x7A, 2, &data[2]))
	return -1;
    if (i2c_read (st.hw->addr, 0x7D, 2, &data[4]))
	return -1;
    accel_bias[0] = ((long) data[0] << 8) | data[1];
    accel_bias[1] = ((long) data[2] << 8) | data[3];
    accel_bias[2] = ((long) data[4] << 8) | data[5];
    return 0;
}

/**
 *  @brief      Read biases to the accel bias 6050 registers.
 *  This function reads from the MPU6050 accel offset cancellations registers.
 *  The format are G in +-8G format. The register is initialized with OTP
 *  factory trim values.
 *  @param[in]  accel_bias  returned structure with the accel bias
 *  @return     0 if successful.
 */
int mpu_read_6050_accel_bias (long*accel_bias)
{
    unsigned char data[6];
    if (i2c_read (st.hw->addr, 0x06, 2, &data[0]))
	return -1;
    if (i2c_read (st.hw->addr, 0x08, 2, &data[2]))
	return -1;
    if (i2c_read (st.hw->addr, 0x0A, 2, &data[4]))
	return -1;
    accel_bias[0] = ((long) data[0] << 8) | data[1];
    accel_bias[1] = ((long) data[2] << 8) | data[3];
    accel_bias[2] = ((long) data[4] << 8) | data[5];
    return 0;
}

int mpu_read_6500_gyro_bias (long*gyro_bias)
{
    unsigned char data[6];
    if (i2c_read (st.hw->addr, 0x13, 2, &data[0]))
	return -1;
    if (i2c_read (st.hw->addr, 0x15, 2, &data[2]))
	return -1;
    if (i2c_read (st.hw->addr, 0x17, 2, &data[4]))
	return -1;
    gyro_bias[0] = ((long) data[0] << 8) | data[1];
    gyro_bias[1] = ((long) data[2] << 8) | data[3];
    gyro_bias[2] = ((long) data[4] << 8) | data[5];
    return 0;
}

/**
 *  @brief      Push biases to the gyro bias 6500/6050 registers.
 *  This function expects biases relative to the current sensor output, and
 *  these biases will be added to the factory-supplied values. Bias inputs are LSB
 *  in +-1000dps format.
 *  @param[in]  gyro_bias  New biases.
 *  @return     0 if successful.
 */
int mpu_set_gyro_bias_reg (long*gyro_bias)
{
    unsigned char data[6] = { 0, 0, 0, 0, 0, 0 };
    int i = 0;
    for (i = 0; i < 3; i++)
    {
	gyro_bias[i] = (-gyro_bias[i]);
    }
    data[0] = (gyro_bias[0] >> 8) & 0xff;
    data[1] = (gyro_bias[0]) & 0xff;
    data[2] = (gyro_bias[1] >> 8) & 0xff;
    data[3] = (gyro_bias[1]) & 0xff;
    data[4] = (gyro_bias[2] >> 8) & 0xff;
    data[5] = (gyro_bias[2]) & 0xff;
    if (i2c_write (st.hw->addr, 0x13, 2, &data[0]))
	return -1;
    if (i2c_write (st.hw->addr, 0x15, 2, &data[2]))
	return -1;
    if (i2c_write (st.hw->addr, 0x17, 2, &data[4]))
	return -1;
    return 0;
}

/**
 *  @brief      Push biases to the accel bias 6050 registers.
 *  This function expects biases relative to the current sensor output, and
 *  these biases will be added to the factory-supplied values. Bias inputs are LSB
 *  in +-16G format.
 *  @param[in]  accel_bias  New biases.
 *  @return     0 if successful.
 */
int mpu_set_accel_bias_6050_reg (const long*accel_bias)
{
    unsigned char data[6] = { 0, 0, 0, 0, 0, 0 };
    long accel_reg_bias[3] = { 0, 0, 0 };

    if (mpu_read_6050_accel_bias (accel_reg_bias))
	return -1;

    accel_reg_bias[0] -= (accel_bias[0] & ~1);
    accel_reg_bias[1] -= (accel_bias[1] & ~1);
    accel_reg_bias[2] -= (accel_bias[2] & ~1);

    data[0] = (accel_reg_bias[0] >> 8) & 0xff;
    data[1] = (accel_reg_bias[0]) & 0xff;
    data[2] = (accel_reg_bias[1] >> 8) & 0xff;
    data[3] = (accel_reg_bias[1]) & 0xff;
    data[4] = (accel_reg_bias[2] >> 8) & 0xff;
    data[5] = (accel_reg_bias[2]) & 0xff;

    if (i2c_write (st.hw->addr, 0x06, 2, &data[0]))
	return -1;
    if (i2c_write (st.hw->addr, 0x08, 2, &data[2]))
	return -1;
    if (i2c_write (st.hw->addr, 0x0A, 2, &data[4]))
	return -1;

    return 0;
}

/**
 *  @brief      Push biases to the accel bias 6500 registers.
 *  This function expects biases relative to the current sensor output, and
 *  these biases will be added to the factory-supplied values. Bias inputs are LSB
 *  in +-16G format.
 *  @param[in]  accel_bias  New biases.
 *  @return     0 if successful.
 */
int mpu_set_accel_bias_6500_reg (const long*accel_bias)
{
    unsigned char data[6] = { 0, 0, 0, 0, 0, 0 };
    long accel_reg_bias[3] = { 0, 0, 0 };

    if (mpu_read_6500_accel_bias (accel_reg_bias))
	return -1;

    // Preserve bit 0 of factory value (for temperature compensation)
    accel_reg_bias[0] -= (accel_bias[0] & ~1);
    accel_reg_bias[1] -= (accel_bias[1] & ~1);
    accel_reg_bias[2] -= (accel_bias[2] & ~1);

    data[0] = (accel_reg_bias[0] >> 8) & 0xff;
    data[1] = (accel_reg_bias[0]) & 0xff;
    data[2] = (accel_reg_bias[1] >> 8) & 0xff;
    data[3] = (accel_reg_bias[1]) & 0xff;
    data[4] = (accel_reg_bias[2] >> 8) & 0xff;
    data[5] = (accel_reg_bias[2]) & 0xff;

    if (i2c_write (st.hw->addr, 0x77, 2, &data[0]))
	return -1;
    if (i2c_write (st.hw->addr, 0x7A, 2, &data[2]))
	return -1;
    if (i2c_write (st.hw->addr, 0x7D, 2, &data[4]))
	return -1;

    return 0;
}

/**
 *  @brief  Reset FIFO read/write pointers.
 *  @return 0 if successful.
 */
int mpu_reset_fifo (void)
{
    unsigned char data;

    if (!(st.chip_cfg.sensors))
	return -1;

    data = 0;
    if (i2c_write (st.hw->addr, st.reg->int_enable, 1, &data))
	return -1;
    if (i2c_write (st.hw->addr, st.reg->fifo_en, 1, &data))
	return -1;
    if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &data))
	return -1;

    if (st.chip_cfg.dmp_on)
    {
	data = BIT_FIFO_RST | BIT_DMP_RST;
	if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &data))
	    return -1;
	delay_ms (50);
	data = BIT_DMP_EN | BIT_FIFO_EN;
	if (st.chip_cfg.sensors & INV_XYZ_COMPASS)
	    data |= BIT_AUX_IF_EN;
	if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &data))
	    return -1;
	if (st.chip_cfg.int_enable)
	    data = BIT_DMP_INT_EN;
	else
	    data = 0;
	if (i2c_write (st.hw->addr, st.reg->int_enable, 1, &data))
	    return -1;
	data = 0;
	if (i2c_write (st.hw->addr, st.reg->fifo_en, 1, &data))
	    return -1;
    }
    else
    {
	data = BIT_FIFO_RST;
	if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &data))
	    return -1;
	if (st.chip_cfg.bypass_mode || !(st.chip_cfg.sensors & INV_XYZ_COMPASS))
	    data = BIT_FIFO_EN;
	else
	    data = BIT_FIFO_EN | BIT_AUX_IF_EN;
	if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &data))
	    return -1;
	delay_ms (50);
	if (st.chip_cfg.int_enable)
	    data = BIT_DATA_RDY_EN;
	else
	    data = 0;
	if (i2c_write (st.hw->addr, st.reg->int_enable, 1, &data))
	    return -1;
	if (i2c_write (st.hw->addr, st.reg->fifo_en, 1, &st.chip_cfg.fifo_enable))
	    return -1;
    }
    return 0;
}

/**
 *  @brief      Get the gyro full-scale range.
 *  @param[out] fsr Current full-scale range.
 *  @return     0 if successful.
 */
int mpu_get_gyro_fsr (unsigned short*fsr)
{
    switch (st.chip_cfg.gyro_fsr)
    {
	case INV_FSR_250DPS:
	    fsr[0] = 250;
	    break;
	case INV_FSR_500DPS:
	    fsr[0] = 500;
	    break;
	case INV_FSR_1000DPS:
	    fsr[0] = 1000;
	    break;
	case INV_FSR_2000DPS:
	    fsr[0] = 2000;
	    break;
	default:
	    fsr[0] = 0;
	    break;
    }
    return 0;
}

/**
 *  @brief      Set the gyro full-scale range.
 *  @param[in]  fsr Desired full-scale range.
 *  @return     0 if successful.
 */
int mpu_set_gyro_fsr (unsigned short fsr)
{
    unsigned char data;

    if (!(st.chip_cfg.sensors))
	return -1;

    switch (fsr)
    {
	case 250:
	    data = INV_FSR_250DPS << 3;
	    break;
	case 500:
	    data = INV_FSR_500DPS << 3;
	    break;
	case 1000:
	    data = INV_FSR_1000DPS << 3;
	    break;
	case 2000:
	    data = INV_FSR_2000DPS << 3;
	    break;
	default:
	    return -1;
    }

    if (st.chip_cfg.gyro_fsr == (data >> 3))
	return 0;
    if (i2c_write (st.hw->addr, st.reg->gyro_cfg, 1, &data))
	return -1;
    st.chip_cfg.gyro_fsr = data >> 3;
    return 0;
}

/**
 *  @brief      Get the accel full-scale range.
 *  @param[out] fsr Current full-scale range.
 *  @return     0 if successful.
 */
int mpu_get_accel_fsr (unsigned char*fsr)
{
    switch (st.chip_cfg.accel_fsr)
    {
	case INV_FSR_2G:
	    fsr[0] = 2;
	    break;
	case INV_FSR_4G:
	    fsr[0] = 4;
	    break;
	case INV_FSR_8G:
	    fsr[0] = 8;
	    break;
	case INV_FSR_16G:
	    fsr[0] = 16;
	    break;
	default:
	    return -1;
    }
    if (st.chip_cfg.accel_half)
	fsr[0] <<= 1;
    return 0;
}

/**
 *  @brief      Set the accel full-scale range.
 *  @param[in]  fsr Desired full-scale range.
 *  @return     0 if successful.
 */
int mpu_set_accel_fsr (unsigned char fsr)
{
    unsigned char data;

    if (!(st.chip_cfg.sensors))
	return -1;

    switch (fsr)
    {
	case 2:
	    data = INV_FSR_2G << 3;
	    break;
	case 4:
	    data = INV_FSR_4G << 3;
	    break;
	case 8:
	    data = INV_FSR_8G << 3;
	    break;
	case 16:
	    data = INV_FSR_16G << 3;
	    break;
	default:
	    return -1;
    }

    if (st.chip_cfg.accel_fsr == (data >> 3))
	return 0;
    if (i2c_write (st.hw->addr, st.reg->accel_cfg, 1, &data))
	return -1;
    st.chip_cfg.accel_fsr = data >> 3;
    return 0;
}

/**
 *  @brief      Get the current DLPF setting.
 *  @param[out] lpf Current LPF setting.
 *  0 if successful.
 */
int mpu_get_lpf (unsigned short*lpf)
{
    switch (st.chip_cfg.lpf)
    {
	case INV_FILTER_188HZ:
	    lpf[0] = 188;
	    break;
	case INV_FILTER_98HZ:
	    lpf[0] = 98;
	    break;
	case INV_FILTER_42HZ:
	    lpf[0] = 42;
	    break;
	case INV_FILTER_20HZ:
	    lpf[0] = 20;
	    break;
	case INV_FILTER_10HZ:
	    lpf[0] = 10;
	    break;
	case INV_FILTER_5HZ:
	    lpf[0] = 5;
	    break;
	case INV_FILTER_256HZ_NOLPF2:
	case INV_FILTER_2100HZ_NOLPF:
	default:
	    lpf[0] = 0;
	    break;
    }
    return 0;
}

/**
 *  @brief      Set digital low pass filter.
 *  The following LPF settings are supported: 188, 98, 42, 20, 10, 5.
 *  @param[in]  lpf Desired LPF setting.
 *  @return     0 if successful.
 */
int mpu_set_lpf (unsigned short lpf)
{
    unsigned char data;

    if (!(st.chip_cfg.sensors))
	return -1;

    if (lpf >= 188)
	data = INV_FILTER_188HZ;
    else if (lpf >= 98)
	data = INV_FILTER_98HZ;
    else if (lpf >= 42)
	data = INV_FILTER_42HZ;
    else if (lpf >= 20)
	data = INV_FILTER_20HZ;
    else if (lpf >= 10)
	data = INV_FILTER_10HZ;
    else
	data = INV_FILTER_5HZ;

    if (st.chip_cfg.lpf == data)
	return 0;
    if (i2c_write (st.hw->addr, st.reg->lpf, 1, &data))
	return -1;
    st.chip_cfg.lpf = data;
    return 0;
}

/**
 *  @brief      Get sampling rate.
 *  @param[out] rate    Current sampling rate (Hz).
 *  @return     0 if successful.
 */
int mpu_get_sample_rate (unsigned short*rate)
{
    if (st.chip_cfg.dmp_on)
	return -1;
    else
	rate[0] = st.chip_cfg.sample_rate;
    return 0;
}

/**
 *  @brief      Set sampling rate.
 *  Sampling rate must be between 4Hz and 1kHz.
 *  @param[in]  rate    Desired sampling rate (Hz).
 *  @return     0 if successful.
 */
int mpu_set_sample_rate (unsigned short rate)
{
    unsigned char data;

    if (!(st.chip_cfg.sensors))
	return -1;

    if (st.chip_cfg.dmp_on)
	return -1;
    else
    {
	if (st.chip_cfg.lp_accel_mode)
	{
	    if (rate && (rate <= 40))
	    {
		/* Just stay in low-power accel mode. */
		mpu_lp_accel_mode (rate);
		return 0;
	    }
	    /* Requested rate exceeds the allowed frequencies in LP accel mode,
	     * switch back to full-power mode.
	     */
	    mpu_lp_accel_mode (0);
	}
	if (rate < 4)
	    rate = 4;
	else if (rate > 1000)
	    rate = 1000;

