Neo-Du/Stm32F429IGT6_Learning/28_MPU9250/Drivers/BSP/eMPL/inv_mpu.c
	data = 1000 / rate - 1;
	if (i2c_write (st.hw->addr, st.reg->rate_div, 1, &data))
	    return -1;

	st.chip_cfg.sample_rate = 1000 / (1 + data);

#ifdef AK89xx_SECONDARY
	mpu_set_compass_sample_rate (min(st.chip_cfg.compass_sample_rate, MAX_COMPASS_SAMPLE_RATE));
#endif

	/* Automatically set LPF to 1/2 sampling rate. */
	mpu_set_lpf (st.chip_cfg.sample_rate >> 1);
	return 0;
    }
}

/**
 *  @brief      Get compass sampling rate.
 *  @param[out] rate    Current compass sampling rate (Hz).
 *  @return     0 if successful.
 */
int mpu_get_compass_sample_rate (unsigned short*rate)
{
#ifdef AK89xx_SECONDARY
    rate[0] = st.chip_cfg.compass_sample_rate;
    return 0;
#else
    rate[0] = 0;
    return -1;
#endif
}

/**
 *  @brief      Set compass sampling rate.
 *  The compass on the auxiliary I2C bus is read by the MPU hardware at a
 *  maximum of 100Hz. The actual rate can be set to a fraction of the gyro
 *  sampling rate.
 *
 *  \n WARNING: The new rate may be different than what was requested. Call
 *  mpu_get_compass_sample_rate to check the actual setting.
 *  @param[in]  rate    Desired compass sampling rate (Hz).
 *  @return     0 if successful.
 */
int mpu_set_compass_sample_rate (unsigned short rate)
{
#ifdef AK89xx_SECONDARY
    unsigned char div;
    if (!rate || rate > st.chip_cfg.sample_rate || rate > MAX_COMPASS_SAMPLE_RATE)
	return -1;

    div = st.chip_cfg.sample_rate / rate - 1;
    if (i2c_write (st.hw->addr, st.reg->s4_ctrl, 1, &div))
	return -1;
    st.chip_cfg.compass_sample_rate = st.chip_cfg.sample_rate / (div + 1);
    return 0;
#else
    return -1;
#endif
}

/**
 *  @brief      Get gyro sensitivity scale factor.
 *  @param[out] sens    Conversion from hardware units to dps.
 *  @return     0 if successful.
 */
int mpu_get_gyro_sens (float*sens)
{
    switch (st.chip_cfg.gyro_fsr)
    {
	case INV_FSR_250DPS:
	    sens[0] = 131.f;
	    break;
	case INV_FSR_500DPS:
	    sens[0] = 65.5f;
	    break;
	case INV_FSR_1000DPS:
	    sens[0] = 32.8f;
	    break;
	case INV_FSR_2000DPS:
	    sens[0] = 16.4f;
	    break;
	default:
	    return -1;
    }
    return 0;
}

/**
 *  @brief      Get accel sensitivity scale factor.
 *  @param[out] sens    Conversion from hardware units to g's.
 *  @return     0 if successful.
 */
int mpu_get_accel_sens (unsigned short*sens)
{
    switch (st.chip_cfg.accel_fsr)
    {
	case INV_FSR_2G:
	    sens[0] = 16384;
	    break;
	case INV_FSR_4G:
	    sens[0] = 8192;
	    break;
	case INV_FSR_8G:
	    sens[0] = 4096;
	    break;
	case INV_FSR_16G:
	    sens[0] = 2048;
	    break;
	default:
	    return -1;
    }
    if (st.chip_cfg.accel_half)
	sens[0] >>= 1;
    return 0;
}

/**
 *  @brief      Get current FIFO configuration.
 *  @e sensors can contain a combination of the following flags:
 *  \n INV_X_GYRO, INV_Y_GYRO, INV_Z_GYRO
 *  \n INV_XYZ_GYRO
 *  \n INV_XYZ_ACCEL
 *  @param[out] sensors Mask of sensors in FIFO.
 *  @return     0 if successful.
 */
int mpu_get_fifo_config (unsigned char*sensors)
{
    sensors[0] = st.chip_cfg.fifo_enable;
    return 0;
}

/**
 *  @brief      Select which sensors are pushed to FIFO.
 *  @e sensors can contain a combination of the following flags:
 *  \n INV_X_GYRO, INV_Y_GYRO, INV_Z_GYRO
 *  \n INV_XYZ_GYRO
 *  \n INV_XYZ_ACCEL
 *  @param[in]  sensors Mask of sensors to push to FIFO.
 *  @return     0 if successful.
 */
int mpu_configure_fifo (unsigned char sensors)
{
    unsigned char prev;
    int result = 0;

    /* Compass data isn't going into the FIFO. Stop trying. */
    sensors &= ~INV_XYZ_COMPASS;

    if (st.chip_cfg.dmp_on)
	return 0;
    else
    {
	if (!(st.chip_cfg.sensors))
	    return -1;
	prev = st.chip_cfg.fifo_enable;
	st.chip_cfg.fifo_enable = sensors & st.chip_cfg.sensors;
	if (st.chip_cfg.fifo_enable != sensors)
	    /* You're not getting what you asked for. Some sensors are
	     * asleep.
	     */
	    result = -1;
	else
	    result = 0;
	if (sensors || st.chip_cfg.lp_accel_mode)
	    set_int_enable (1);
	else
	    set_int_enable (0);
	if (sensors)
	{
	    if (mpu_reset_fifo ())
	    {
		st.chip_cfg.fifo_enable = prev;
		return -1;
	    }
	}
    }

    return result;
}

/**
 *  @brief      Get current power state.
 *  @param[in]  power_on    1 if turned on, 0 if suspended.
 *  @return     0 if successful.
 */
int mpu_get_power_state (unsigned char*power_on)
{
    if (st.chip_cfg.sensors)
	power_on[0] = 1;
    else
	power_on[0] = 0;
    return 0;
}

/**
 *  @brief      Turn specific sensors on/off.
 *  @e sensors can contain a combination of the following flags:
 *  \n INV_X_GYRO, INV_Y_GYRO, INV_Z_GYRO
 *  \n INV_XYZ_GYRO
 *  \n INV_XYZ_ACCEL
 *  \n INV_XYZ_COMPASS
 *  @param[in]  sensors    Mask of sensors to wake.
 *  @return     0 if successful.
 */
int mpu_set_sensors (unsigned char sensors)
{
    unsigned char data;
#ifdef AK89xx_SECONDARY
    unsigned char user_ctrl;
#endif

    if (sensors & INV_XYZ_GYRO)
	data = INV_CLK_PLL;
    else if (sensors)
	data = 0;
    else
	data = BIT_SLEEP;
    if (i2c_write (st.hw->addr, st.reg->pwr_mgmt_1, 1, &data))
    {
	st.chip_cfg.sensors = 0;
	return -1;
    }
    st.chip_cfg.clk_src = data & ~BIT_SLEEP;

    data = 0;
    if (!(sensors & INV_X_GYRO))
	data |= BIT_STBY_XG;
    if (!(sensors & INV_Y_GYRO))
	data |= BIT_STBY_YG;
    if (!(sensors & INV_Z_GYRO))
	data |= BIT_STBY_ZG;
    if (!(sensors & INV_XYZ_ACCEL))
	data |= BIT_STBY_XYZA;
    if (i2c_write (st.hw->addr, st.reg->pwr_mgmt_2, 1, &data))
    {
	st.chip_cfg.sensors = 0;
	return -1;
    }

    if (sensors && (sensors != INV_XYZ_ACCEL))
	/* Latched interrupts only used in LP accel mode. */
	mpu_set_int_latched (0);

#ifdef AK89xx_SECONDARY
#ifdef AK89xx_BYPASS
    if (sensors & INV_XYZ_COMPASS)
        mpu_set_bypass(1);
    else
        mpu_set_bypass(0);
#else
    if (i2c_read (st.hw->addr, st.reg->user_ctrl, 1, &user_ctrl))
	return -1;
    /* Handle AKM power management. */
    if (sensors & INV_XYZ_COMPASS)
    {
	data = AKM_SINGLE_MEASUREMENT;
	user_ctrl |= BIT_AUX_IF_EN;
    }
    else
    {
	data = AKM_POWER_DOWN;
	user_ctrl &= ~BIT_AUX_IF_EN;
    }
    if (st.chip_cfg.dmp_on)
	user_ctrl |= BIT_DMP_EN;
    else
	user_ctrl &= ~BIT_DMP_EN;
    if (i2c_write (st.hw->addr, st.reg->s1_do, 1, &data))
	return -1;
    /* Enable/disable I2C master mode. */
    if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &user_ctrl))
	return -1;
#endif
#endif

