Neo-Du/Stm32F429IGT6_Learning/28_MPU9250/Drivers/BSP/eMPL/inv_mpu.c
    st.chip_cfg.sensors = sensors;
    st.chip_cfg.lp_accel_mode = 0;
    delay_ms (50);
    return 0;
}

/**
 *  @brief      Read the MPU interrupt status registers.
 *  @param[out] status  Mask of interrupt bits.
 *  @return     0 if successful.
 */
int mpu_get_int_status (short*status)
{
    unsigned char tmp[2];
    if (!st.chip_cfg.sensors)
	return -1;
    if (i2c_read (st.hw->addr, st.reg->dmp_int_status, 2, tmp))
	return -1;
    status[0] = (tmp[0] << 8) | tmp[1];
    return 0;
}

/**
 *  @brief      Get one packet from the FIFO.
 *  If @e sensors does not contain a particular sensor, disregard the data
 *  returned to that pointer.
 *  \n @e sensors can contain a combination of the following flags:
 *  \n INV_X_GYRO, INV_Y_GYRO, INV_Z_GYRO
 *  \n INV_XYZ_GYRO
 *  \n INV_XYZ_ACCEL
 *  \n If the FIFO has no new data, @e sensors will be zero.
 *  \n If the FIFO is disabled, @e sensors will be zero and this function will
 *  return a non-zero error code.
 *  @param[out] gyro        Gyro data in hardware units.
 *  @param[out] accel       Accel data in hardware units.
 *  @param[out] timestamp   Timestamp in milliseconds.
 *  @param[out] sensors     Mask of sensors read from FIFO.
 *  @param[out] more        Number of remaining packets.
 *  @return     0 if successful.
 */
int mpu_read_fifo (short*gyro,short*accel,unsigned long*timestamp,unsigned char*sensors,unsigned char*more)
{
    /* Assumes maximum packet size is gyro (6) + accel (6). */
    unsigned char data[MAX_PACKET_LENGTH];
    unsigned char packet_size = 0;
    unsigned short fifo_count, index = 0;

    if (st.chip_cfg.dmp_on)
	return -1;

    sensors[0] = 0;
    if (!st.chip_cfg.sensors)
	return -1;
    if (!st.chip_cfg.fifo_enable)
	return -1;

    if (st.chip_cfg.fifo_enable & INV_X_GYRO)
	packet_size += 2;
    if (st.chip_cfg.fifo_enable & INV_Y_GYRO)
	packet_size += 2;
    if (st.chip_cfg.fifo_enable & INV_Z_GYRO)
	packet_size += 2;
    if (st.chip_cfg.fifo_enable & INV_XYZ_ACCEL)
	packet_size += 6;

    if (i2c_read (st.hw->addr, st.reg->fifo_count_h, 2, data))
	return -1;
    fifo_count = (data[0] << 8) | data[1];
    if (fifo_count < packet_size)
	return 0;
//    log_i("FIFO count: %hd\n", fifo_count);
    if (fifo_count > (st.hw->max_fifo >> 1))
    {
	/* FIFO is 50% full, better check overflow bit. */
	if (i2c_read (st.hw->addr, st.reg->int_status, 1, data))
	    return -1;
	if (data[0] & BIT_FIFO_OVERFLOW)
	{
	    mpu_reset_fifo ();
	    return -2;
	}
    }
    get_ms ((unsigned long*) timestamp);

    if (i2c_read (st.hw->addr, st.reg->fifo_r_w, packet_size, data))
	return -1;
    more[0] = fifo_count / packet_size - 1;
    sensors[0] = 0;

    if ((index != packet_size) && st.chip_cfg.fifo_enable & INV_XYZ_ACCEL)
    {
	accel[0] = (data[index + 0] << 8) | data[index + 1];
	accel[1] = (data[index + 2] << 8) | data[index + 3];
	accel[2] = (data[index + 4] << 8) | data[index + 5];
	sensors[0] |= INV_XYZ_ACCEL;
	index += 6;
    }
    if ((index != packet_size) && st.chip_cfg.fifo_enable & INV_X_GYRO)
    {
	gyro[0] = (data[index + 0] << 8) | data[index + 1];
	sensors[0] |= INV_X_GYRO;
	index += 2;
    }
    if ((index != packet_size) && st.chip_cfg.fifo_enable & INV_Y_GYRO)
    {
	gyro[1] = (data[index + 0] << 8) | data[index + 1];
	sensors[0] |= INV_Y_GYRO;
	index += 2;
    }
    if ((index != packet_size) && st.chip_cfg.fifo_enable & INV_Z_GYRO)
    {
	gyro[2] = (data[index + 0] << 8) | data[index + 1];
	sensors[0] |= INV_Z_GYRO;
	index += 2;
    }

    return 0;
}

/**
 *  @brief      Get one unparsed packet from the FIFO.
 *  This function should be used if the packet is to be parsed elsewhere.
 *  @param[in]  length  Length of one FIFO packet.
 *  @param[in]  data    FIFO packet.
 *  @param[in]  more    Number of remaining packets.
 */
int mpu_read_fifo_stream (unsigned short length,unsigned char*data,unsigned char*more)
{
    unsigned char tmp[2];
    unsigned short fifo_count;
    if (!st.chip_cfg.dmp_on)
	return -1;
    if (!st.chip_cfg.sensors)
	return -1;

    if (i2c_read (st.hw->addr, st.reg->fifo_count_h, 2, tmp))
	return -1;
    fifo_count = (tmp[0] << 8) | tmp[1];
    if (fifo_count < length)
    {
	more[0] = 0;
	return -1;
    }
    if (fifo_count > (st.hw->max_fifo >> 1))
    {
	/* FIFO is 50% full, better check overflow bit. */
	if (i2c_read (st.hw->addr, st.reg->int_status, 1, tmp))
	    return -1;
	if (tmp[0] & BIT_FIFO_OVERFLOW)
	{
	    mpu_reset_fifo ();
	    return -2;
	}
    }

    if (i2c_read (st.hw->addr, st.reg->fifo_r_w, length, data))
	return -1;
    more[0] = fifo_count / length - 1;
    return 0;
}

/**
 *  @brief      Set device to bypass mode.
 *  @param[in]  bypass_on   1 to enable bypass mode.
 *  @return     0 if successful.
 */
int mpu_set_bypass (unsigned char bypass_on)
{
    unsigned char tmp;

    if (st.chip_cfg.bypass_mode == bypass_on)
	return 0;

    if (bypass_on)
    {
	if (i2c_read (st.hw->addr, st.reg->user_ctrl, 1, &tmp))
	    return -1;
	tmp &= ~BIT_AUX_IF_EN;
	if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &tmp))
	    return -1;
	delay_ms (3);
	tmp = BIT_BYPASS_EN;
	if (st.chip_cfg.active_low_int)
	    tmp |= BIT_ACTL;
	if (st.chip_cfg.latched_int)
	    tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
	if (i2c_write (st.hw->addr, st.reg->int_pin_cfg, 1, &tmp))
	    return -1;
    }
    else
    {
	/* Enable I2C master mode if compass is being used. */
	if (i2c_read (st.hw->addr, st.reg->user_ctrl, 1, &tmp))
	    return -1;
	if (st.chip_cfg.sensors & INV_XYZ_COMPASS)
	    tmp |= BIT_AUX_IF_EN;
	else
	    tmp &= ~BIT_AUX_IF_EN;
	if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, &tmp))
	    return -1;
	delay_ms (3);
	if (st.chip_cfg.active_low_int)
	    tmp = BIT_ACTL;
	else
	    tmp = 0;
	if (st.chip_cfg.latched_int)
	    tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
	if (i2c_write (st.hw->addr, st.reg->int_pin_cfg, 1, &tmp))
	    return -1;
    }
    st.chip_cfg.bypass_mode = bypass_on;
    return 0;
}

/**
 *  @brief      Set interrupt level.
 *  @param[in]  active_low  1 for active low, 0 for active high.
 *  @return     0 if successful.
 */
int mpu_set_int_level (unsigned char active_low)
{
    st.chip_cfg.active_low_int = active_low;
    return 0;
}

/**
 *  @brief      Enable latched interrupts.
 *  Any MPU register will clear the interrupt.
 *  @param[in]  enable  1 to enable, 0 to disable.
 *  @return     0 if successful.
 */
int mpu_set_int_latched (unsigned char enable)
{
    unsigned char tmp;
    if (st.chip_cfg.latched_int == enable)
	return 0;

    if (enable)
	tmp = BIT_LATCH_EN | BIT_ANY_RD_CLR;
    else
	tmp = 0;
    if (st.chip_cfg.bypass_mode)
	tmp |= BIT_BYPASS_EN;
    if (st.chip_cfg.active_low_int)
	tmp |= BIT_ACTL;
    if (i2c_write (st.hw->addr, st.reg->int_pin_cfg, 1, &tmp))
	return -1;
    st.chip_cfg.latched_int = enable;
    return 0;
}

#ifdef MPU6050
static int get_accel_prod_shift(float *st_shift)
{
    unsigned char tmp[4], shift_code[3], ii;

