Neo-Du/Stm32F429IGT6_Learning/28_MPU9250/Drivers/BSP/eMPL/inv_mpu.c
    return 0;
}

#ifdef MPU6500
#define REG_6500_XG_ST_DATA     0x0
#define REG_6500_XA_ST_DATA     0xD
static const unsigned short mpu_6500_st_tb[256] = { 2620, 2646, 2672, 2699, 2726, 2753, 2781,
	2808, //7
	2837, 2865, 2894, 2923, 2952, 2981, 3011,
	3041, //15
	3072, 3102, 3133, 3165, 3196, 3228, 3261,
	3293, //23
	3326, 3359, 3393, 3427, 3461, 3496, 3531,
	3566, //31
	3602, 3638, 3674, 3711, 3748, 3786, 3823,
	3862, //39
	3900, 3939, 3979, 4019, 4059, 4099, 4140,
	4182, //47
	4224, 4266, 4308, 4352, 4395, 4439, 4483,
	4528, //55
	4574, 4619, 4665, 4712, 4759, 4807, 4855,
	4903, //63
	4953, 5002, 5052, 5103, 5154, 5205, 5257,
	5310, //71
	5363, 5417, 5471, 5525, 5581, 5636, 5693,
	5750, //79
	5807, 5865, 5924, 5983, 6043, 6104, 6165,
	6226, //87
	6289, 6351, 6415, 6479, 6544, 6609, 6675,
	6742, //95
	6810, 6878, 6946, 7016, 7086, 7157, 7229,
	7301, //103
	7374, 7448, 7522, 7597, 7673, 7750, 7828,
	7906, //111
	7985, 8065, 8145, 8227, 8309, 8392, 8476,
	8561, //119
	8647, 8733, 8820, 8909, 8998, 9088, 9178, 9270, 9363, 9457, 9551, 9647, 9743, 9841, 9939, 10038, 10139, 10240, 10343, 10446, 10550, 10656, 10763, 10870, 10979, 11089, 11200, 11312, 11425,
	11539, 11654, 11771, 11889, 12008, 12128, 12249, 12371, 12495, 12620, 12746, 12874, 13002, 13132, 13264, 13396, 13530, 13666, 13802, 13940, 14080, 14221, 14363, 14506, 14652, 14798, 14946,
	15096, 15247, 15399, 15553, 15709, 15866, 16024, 16184, 16346, 16510, 16675, 16842, 17010, 17180, 17352, 17526, 17701, 17878, 18057, 18237, 18420, 18604, 18790, 18978, 19167, 19359, 19553,
	19748, 19946, 20145, 20347, 20550, 20756, 20963, 21173, 21385, 21598, 21814, 22033, 22253, 22475, 22700, 22927, 23156, 23388, 23622, 23858, 24097, 24338, 24581, 24827, 25075, 25326, 25579,
	25835, 26093, 26354, 26618, 26884, 27153, 27424, 27699, 27976, 28255, 28538, 28823, 29112, 29403, 29697, 29994, 30294, 30597, 30903, 31212, 31524, 31839, 32157, 32479, 32804, 33132 };
static int accel_6500_self_test (long*bias_regular,long*bias_st,int debug)
{
    int i, result = 0, otp_value_zero = 0;
    float accel_st_al_min, accel_st_al_max;
    float st_shift_cust[3], st_shift_ratio[3], ct_shift_prod[3], accel_offset_max;
    unsigned char regs[3];
    if (i2c_read (st.hw->addr, REG_6500_XA_ST_DATA, 3, regs))
    {
	if (debug)
	    log_i ("Reading OTP Register Error.\n");
	return 0x07;
    }
    if (debug)
	log_i ("Accel OTP:%d, %d, %d\n", regs[0], regs[1], regs[2]);
    for (i = 0; i < 3; i++)
    {
	if (regs[i] != 0)
	{
	    ct_shift_prod[i] = mpu_6500_st_tb[regs[i] - 1];
	    ct_shift_prod[i] *= 65536.f;
	    ct_shift_prod[i] /= test.accel_sens;
	}
	else
	{
	    ct_shift_prod[i] = 0;
	    otp_value_zero = 1;
	}
    }
    if (otp_value_zero == 0)
    {
	if (debug)
	    log_i ("ACCEL:CRITERIA A\n");
	for (i = 0; i < 3; i++)
	{
	    st_shift_cust[i] = bias_st[i] - bias_regular[i];
	    if (debug)
	    {
		log_i ("Bias_Shift=%7.4f, Bias_Reg=%7.4f, Bias_HWST=%7.4f\r\n", st_shift_cust[i] / 1.f, bias_regular[i] / 1.f, bias_st[i] / 1.f);
		log_i ("OTP value: %7.4f\r\n", ct_shift_prod[i] / 1.f);
	    }

	    st_shift_ratio[i] = st_shift_cust[i] / ct_shift_prod[i] - 1.f;

	    if (debug)
		log_i ("ratio=%7.4f, threshold=%7.4f\r\n", st_shift_ratio[i] / 1.f, test.max_accel_var / 1.f);

	    if (fabs (st_shift_ratio[i]) > test.max_accel_var)
	    {
		if (debug)
		    log_i ("ACCEL Fail Axis = %d\n", i);
		result |= 1 << i;	//Error condition
	    }
	}
    }
    else
    {
	/* Self Test Pass/Fail Criteria B */
	accel_st_al_min = test.min_g * 65536.f;
	accel_st_al_max = test.max_g * 65536.f;

	if (debug)
	{
	    log_i ("ACCEL:CRITERIA B\r\n");
	    log_i ("Min MG: %7.4f\r\n", accel_st_al_min / 1.f);
	    log_i ("Max MG: %7.4f\r\n", accel_st_al_max / 1.f);
	}

	for (i = 0; i < 3; i++)
	{
	    st_shift_cust[i] = bias_st[i] - bias_regular[i];

	    if (debug)
		log_i ("Bias_shift=%7.4f, st=%7.4f, reg=%7.4f\n", st_shift_cust[i] / 1.f, bias_st[i] / 1.f, bias_regular[i] / 1.f);
	    if (st_shift_cust[i] < accel_st_al_min || st_shift_cust[i] > accel_st_al_max)
	    {
		if (debug)
		    log_i ("Accel FAIL axis:%d <= 225mg or >= 675mg\n", i);
		result |= 1 << i;	//Error condition
	    }
	}
    }

    if (result == 0)
    {
	/* Self Test Pass/Fail Criteria C */
	accel_offset_max = test.max_g_offset * 65536.f;
	if (debug)
	    log_i ("Accel:CRITERIA C: bias less than %7.4f\n", accel_offset_max / 1.f);
	for (i = 0; i < 3; i++)
	{
	    if (fabs (bias_regular[i]) > accel_offset_max)
	    {
		if (debug)
		    log_i ("FAILED: Accel axis:%d = %ld > 500mg\n", i, bias_regular[i]);
		result |= 1 << i;	//Error condition
	    }
	}
    }

    return result;
}

static int gyro_6500_self_test (long*bias_regular,long*bias_st,int debug)
{
    int i, result = 0, otp_value_zero = 0;
    float gyro_st_al_max;
    float st_shift_cust[3], st_shift_ratio[3], ct_shift_prod[3], gyro_offset_max;
    unsigned char regs[3];

    if (i2c_read (st.hw->addr, REG_6500_XG_ST_DATA, 3, regs))
    {
	if (debug)
	    log_i ("Reading OTP Register Error.\n");
	return 0x07;
    }

    if (debug)
	log_i ("Gyro OTP:%d, %d, %d\r\n", regs[0], regs[1], regs[2]);

    for (i = 0; i < 3; i++)
    {
	if (regs[i] != 0)
	{
	    ct_shift_prod[i] = mpu_6500_st_tb[regs[i] - 1];
	    ct_shift_prod[i] *= 65536.f;
	    ct_shift_prod[i] /= test.gyro_sens;
	}
	else
	{
	    ct_shift_prod[i] = 0;
	    otp_value_zero = 1;
	}
    }

    if (otp_value_zero == 0)
    {
	if (debug)
	    log_i ("GYRO:CRITERIA A\n");
	/* Self Test Pass/Fail Criteria A */
	for (i = 0; i < 3; i++)
	{
	    st_shift_cust[i] = bias_st[i] - bias_regular[i];

	    if (debug)
	    {
		log_i ("Bias_Shift=%7.4f, Bias_Reg=%7.4f, Bias_HWST=%7.4f\r\n", st_shift_cust[i] / 1.f, bias_regular[i] / 1.f, bias_st[i] / 1.f);
		log_i ("OTP value: %7.4f\r\n", ct_shift_prod[i] / 1.f);
	    }

	    st_shift_ratio[i] = st_shift_cust[i] / ct_shift_prod[i];

	    if (debug)
		log_i ("ratio=%7.4f, threshold=%7.4f\r\n", st_shift_ratio[i] / 1.f, test.max_gyro_var / 1.f);

	    if (fabs (st_shift_ratio[i]) < test.max_gyro_var)
	    {
		if (debug)
		    log_i ("Gyro Fail Axis = %d\n", i);
		result |= 1 << i;	//Error condition
	    }
	}
    }
    else
    {
	/* Self Test Pass/Fail Criteria B */
	gyro_st_al_max = test.max_dps * 65536.f;

	if (debug)
	{
	    log_i ("GYRO:CRITERIA B\r\n");
	    log_i ("Max DPS: %7.4f\r\n", gyro_st_al_max / 1.f);
	}

	for (i = 0; i < 3; i++)
	{
	    st_shift_cust[i] = bias_st[i] - bias_regular[i];

	    if (debug)
		log_i ("Bias_shift=%7.4f, st=%7.4f, reg=%7.4f\n", st_shift_cust[i] / 1.f, bias_st[i] / 1.f, bias_regular[i] / 1.f);
	    if (st_shift_cust[i] < gyro_st_al_max)
	    {
		if (debug)
		    log_i ("GYRO FAIL axis:%d greater than 60dps\n", i);
		result |= 1 << i;	//Error condition
	    }
	}
    }

    if (result == 0)
    {
	/* Self Test Pass/Fail Criteria C */
	gyro_offset_max = test.min_dps * 65536.f;
	if (debug)
	    log_i ("Gyro:CRITERIA C: bias less than %7.4f\n", gyro_offset_max / 1.f);
	for (i = 0; i < 3; i++)
	{
	    if (fabs (bias_regular[i]) > gyro_offset_max)
	    {
		if (debug)
		    log_i ("FAILED: Gyro axis:%d = %ld > 20dps\n", i, bias_regular[i]);
		result |= 1 << i;	//Error condition
	    }
	}
    }
    return result;
}

static int get_st_6500_biases (long*gyro,long*accel,unsigned char hw_test,int debug)
{
    unsigned char data[HWST_MAX_PACKET_LENGTH];
    unsigned char packet_count, ii;
    unsigned short fifo_count;
    int s = 0, read_size = 0, ind;

    data[0] = 0x01;
    data[1] = 0;
    if (i2c_write (st.hw->addr, st.reg->pwr_mgmt_1, 2, data))
	return -1;
    delay_ms (200);
    data[0] = 0;
    if (i2c_write (st.hw->addr, st.reg->int_enable, 1, data))
	return -1;
    if (i2c_write (st.hw->addr, st.reg->fifo_en, 1, data))
	return -1;
    if (i2c_write (st.hw->addr, st.reg->pwr_mgmt_1, 1, data))
	return -1;
    if (i2c_write (st.hw->addr, st.reg->i2c_mst, 1, data))
	return -1;
    if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, data))
	return -1;
    data[0] = BIT_FIFO_RST | BIT_DMP_RST;
    if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, data))
	return -1;
    delay_ms (15);
    data[0] = st.test->reg_lpf;
    if (i2c_write (st.hw->addr, st.reg->lpf, 1, data))
	return -1;
    data[0] = st.test->reg_rate_div;
    if (i2c_write (st.hw->addr, st.reg->rate_div, 1, data))
	return -1;
    if (hw_test)
	data[0] = st.test->reg_gyro_fsr | 0xE0;
    else
	data[0] = st.test->reg_gyro_fsr;
    if (i2c_write (st.hw->addr, st.reg->gyro_cfg, 1, data))
	return -1;

    if (hw_test)
	data[0] = st.test->reg_accel_fsr | 0xE0;
    else
	data[0] = test.reg_accel_fsr;
    if (i2c_write (st.hw->addr, st.reg->accel_cfg, 1, data))
	return -1;

    delay_ms (test.wait_ms);  //wait 200ms for sensors to stabilize

    /* Enable FIFO */
    data[0] = BIT_FIFO_EN;
    if (i2c_write (st.hw->addr, st.reg->user_ctrl, 1, data))
	return -1;
    data[0] = INV_XYZ_GYRO | INV_XYZ_ACCEL;
    if (i2c_write (st.hw->addr, st.reg->fifo_en, 1, data))
	return -1;

    //initialize the bias return values
    gyro[0] = gyro[1] = gyro[2] = 0;
    accel[0] = accel[1] = accel[2] = 0;

    if (debug)
	log_i ("Starting Bias Loop Reads\n");

    //start reading samples
    while (s < test.packet_thresh)
    {
	delay_ms (test.sample_wait_ms); //wait 10ms to fill FIFO
	if (i2c_read (st.hw->addr, st.reg->fifo_count_h, 2, data))
	    return -1;
	fifo_count = (data[0] << 8) | data[1];
	packet_count = fifo_count / MAX_PACKET_LENGTH;
	if ((test.packet_thresh - s) < packet_count)
	    packet_count = test.packet_thresh - s;
	read_size = packet_count * MAX_PACKET_LENGTH;

	//burst read from FIFO
	if (i2c_read (st.hw->addr, st.reg->fifo_r_w, read_size, data))
	    return -1;
	ind = 0;
	for (ii = 0; ii < packet_count; ii++)
	{
	    short accel_cur[3], gyro_cur[3];
	    accel_cur[0] = ((short) data[ind + 0] << 8) | data[ind + 1];
	    accel_cur[1] = ((short) data[ind + 2] << 8) | data[ind + 3];
	    accel_cur[2] = ((short) data[ind + 4] << 8) | data[ind + 5];
	    accel[0] += (long) accel_cur[0];
	    accel[1] += (long) accel_cur[1];
	    accel[2] += (long) accel_cur[2];
	    gyro_cur[0] = (((short) data[ind + 6] << 8) | data[ind + 7]);
	    gyro_cur[1] = (((short) data[ind + 8] << 8) | data[ind + 9]);
	    gyro_cur[2] = (((short) data[ind + 10] << 8) | data[ind + 11]);
	    gyro[0] += (long) gyro_cur[0];
	    gyro[1] += (long) gyro_cur[1];
	    gyro[2] += (long) gyro_cur[2];
	    ind += MAX_PACKET_LENGTH;
	}
	s += packet_count;
    }

    if (debug)
	log_i ("Samples: %d\n", s);

    //stop FIFO
    data[0] = 0;
    if (i2c_write (st.hw->addr, st.reg->fifo_en, 1, data))
	return -1;

