Neo-Du/Stm32F429IGT6_Learning/28_MPU9250/Drivers/BSP/eMPL/inv_mpu.c
    gyro[0] = (long) (((long long) gyro[0] << 16) / test.gyro_sens / s);
    gyro[1] = (long) (((long long) gyro[1] << 16) / test.gyro_sens / s);
    gyro[2] = (long) (((long long) gyro[2] << 16) / test.gyro_sens / s);
    accel[0] = (long) (((long long) accel[0] << 16) / test.accel_sens / s);
    accel[1] = (long) (((long long) accel[1] << 16) / test.accel_sens / s);
    accel[2] = (long) (((long long) accel[2] << 16) / test.accel_sens / s);
    /* remove gravity from bias calculation */
    if (accel[2] > 0L)
	accel[2] -= 65536L;
    else
	accel[2] += 65536L;

    if (debug)
    {
	log_i ("Accel offset data HWST bit=%d: %7.4f %7.4f %7.4f\r\n", hw_test, accel[0] / 65536.f, accel[1] / 65536.f, accel[2] / 65536.f);
	log_i ("Gyro offset data HWST bit=%d: %7.4f %7.4f %7.4f\r\n", hw_test, gyro[0] / 65536.f, gyro[1] / 65536.f, gyro[2] / 65536.f);
    }

    return 0;
}
/**
 *  @brief      Trigger gyro/accel/compass self-test for MPU6500/MPU9250
 *  On success/error, the self-test returns a mask representing the sensor(s)
 *  that failed. For each bit, a one (1) represents a "pass" case; conversely,
 *  a zero (0) indicates a failure.
 *
 *  \n The mask is defined as follows:
 *  \n Bit 0:   Gyro.
 *  \n Bit 1:   Accel.
 *  \n Bit 2:   Compass.
 *
 *  @param[out] gyro        Gyro biases in q16 format.
 *  @param[out] accel       Accel biases (if applicable) in q16 format.
 *  @param[in]  debug       Debug flag used to print out more detailed logs. Must first set up logging in Motion Driver.
 *  @return     Result mask (see above).
 */
int mpu_run_6500_self_test (long*gyro,long*accel,unsigned char debug)
{
    const unsigned char tries = 2;
    long gyro_st[3], accel_st[3];
    unsigned char accel_result, gyro_result;
#ifdef AK89xx_SECONDARY
    unsigned char compass_result;
#endif
    int ii;

    int result;
    unsigned char accel_fsr, fifo_sensors, sensors_on;
    unsigned short gyro_fsr, sample_rate, lpf;
    unsigned char dmp_was_on;

    if (debug)
	log_i ("Starting MPU6500 HWST!\r\n");

    if (st.chip_cfg.dmp_on)
    {
	mpu_set_dmp_state (0);
	dmp_was_on = 1;
    }
    else
	dmp_was_on = 0;

    /* Get initial settings. */
    mpu_get_gyro_fsr (&gyro_fsr);
    mpu_get_accel_fsr (&accel_fsr);
    mpu_get_lpf (&lpf);
    mpu_get_sample_rate (&sample_rate);
    sensors_on = st.chip_cfg.sensors;
    mpu_get_fifo_config (&fifo_sensors);

    if (debug)
	log_i ("Retrieving Biases\r\n");

    for (ii = 0; ii < tries; ii++)
	if (!get_st_6500_biases (gyro, accel, 0, debug))
	    break;
    if (ii == tries)
    {
	/* If we reach this point, we most likely encountered an I2C error.
	 * We'll just report an error for all three sensors.
	 */
	if (debug)
	    log_i ("Retrieving Biases Error - possible I2C error\n");

	result = 0;
	goto restore;
    }

    if (debug)
	log_i ("Retrieving ST Biases\n");

    for (ii = 0; ii < tries; ii++)
	if (!get_st_6500_biases (gyro_st, accel_st, 1, debug))
	    break;
    if (ii == tries)
    {

	if (debug)
	    log_i ("Retrieving ST Biases Error - possible I2C error\n");

	/* Again, probably an I2C error. */
	result = 0;
	goto restore;
    }

    accel_result = accel_6500_self_test (accel, accel_st, debug);
    if (debug)
	log_i ("Accel Self Test Results: %d\n", accel_result);

    gyro_result = gyro_6500_self_test (gyro, gyro_st, debug);
    if (debug)
	log_i ("Gyro Self Test Results: %d\n", gyro_result);

    result = 0;
    if (!gyro_result)
	result |= 0x01;
    if (!accel_result)
	result |= 0x02;

#ifdef AK89xx_SECONDARY
    compass_result = compass_self_test ();
    if (debug)
	log_i ("Compass Self Test Results: %d\n", compass_result);
    if (!compass_result)
	result |= 0x04;
#else
    result |= 0x04;
#endif
restore: if (debug)
	log_i ("Exiting HWST\n");
    /* Set to invalid values to ensure no I2C writes are skipped. */
    st.chip_cfg.gyro_fsr = 0xFF;
    st.chip_cfg.accel_fsr = 0xFF;
    st.chip_cfg.lpf = 0xFF;
    st.chip_cfg.sample_rate = 0xFFFF;
    st.chip_cfg.sensors = 0xFF;
    st.chip_cfg.fifo_enable = 0xFF;
    st.chip_cfg.clk_src = INV_CLK_PLL;
    mpu_set_gyro_fsr (gyro_fsr);
    mpu_set_accel_fsr (accel_fsr);
    mpu_set_lpf (lpf);
    mpu_set_sample_rate (sample_rate);
    mpu_set_sensors (sensors_on);
    mpu_configure_fifo (fifo_sensors);

    if (dmp_was_on)
	mpu_set_dmp_state (1);

    return result;
}
#endif
/*
 *  \n This function must be called with the device either face-up or face-down
 *  (z-axis is parallel to gravity).
 *  @param[out] gyro        Gyro biases in q16 format.
 *  @param[out] accel       Accel biases (if applicable) in q16 format.
 *  @return     Result mask (see above).
 */
int mpu_run_self_test (long*gyro,long*accel)
{
#ifdef MPU6050
    const unsigned char tries = 2;
    long gyro_st[3], accel_st[3];
    unsigned char accel_result, gyro_result;
#ifdef AK89xx_SECONDARY
    unsigned char compass_result;
#endif
    int ii;
#endif
    int result;
    unsigned char accel_fsr, fifo_sensors, sensors_on;
    unsigned short gyro_fsr, sample_rate, lpf;
    unsigned char dmp_was_on;

    if (st.chip_cfg.dmp_on)
    {
	mpu_set_dmp_state (0);
	dmp_was_on = 1;
    }
    else
	dmp_was_on = 0;

    /* Get initial settings. */
    mpu_get_gyro_fsr (&gyro_fsr);
    mpu_get_accel_fsr (&accel_fsr);
    mpu_get_lpf (&lpf);
    mpu_get_sample_rate (&sample_rate);
    sensors_on = st.chip_cfg.sensors;
    mpu_get_fifo_config (&fifo_sensors);

    /* For older chips, the self-test will be different. */
#if defined MPU6050
    for (ii = 0; ii < tries; ii++)
        if (!get_st_biases(gyro, accel, 0))
            break;
    if (ii == tries) {
        /* If we reach this point, we most likely encountered an I2C error.
         * We'll just report an error for all three sensors.
         */
        result = 0;
        goto restore;
    }
    for (ii = 0; ii < tries; ii++)
        if (!get_st_biases(gyro_st, accel_st, 1))
            break;
    if (ii == tries) {
        /* Again, probably an I2C error. */
        result = 0;
        goto restore;
    }
    accel_result = accel_self_test(accel, accel_st);
    gyro_result = gyro_self_test(gyro, gyro_st);

    result = 0;
    if (!gyro_result)
        result |= 0x01;
    if (!accel_result)
        result |= 0x02;

#ifdef AK89xx_SECONDARY
    compass_result = compass_self_test();
    if (!compass_result)
        result |= 0x04;
#else
        result |= 0x04;
#endif
restore:
#elif defined MPU6500
    /* For now, this function will return a "pass" result for all three sensors
     * for compatibility with current test applications.
     */
    get_st_biases (gyro, accel, 0);
    result = 0x7;
#endif
    /* Set to invalid values to ensure no I2C writes are skipped. */
    st.chip_cfg.gyro_fsr = 0xFF;
    st.chip_cfg.accel_fsr = 0xFF;
    st.chip_cfg.lpf = 0xFF;
    st.chip_cfg.sample_rate = 0xFFFF;
    st.chip_cfg.sensors = 0xFF;
    st.chip_cfg.fifo_enable = 0xFF;
    st.chip_cfg.clk_src = INV_CLK_PLL;
    mpu_set_gyro_fsr (gyro_fsr);
    mpu_set_accel_fsr (accel_fsr);
    mpu_set_lpf (lpf);
    mpu_set_sample_rate (sample_rate);
    mpu_set_sensors (sensors_on);
    mpu_configure_fifo (fifo_sensors);

    if (dmp_was_on)
	mpu_set_dmp_state (1);

    return result;
}

/**
 *  @brief      Write to the DMP memory.
 *  This function prevents I2C writes past the bank boundaries. The DMP memory
 *  is only accessible when the chip is awake.
 *  @param[in]  mem_addr    Memory location (bank << 8 | start address)
 *  @param[in]  length      Number of bytes to write.
 *  @param[in]  data        Bytes to write to memory.
 *  @return     0 if successful.
 */
int mpu_write_mem (unsigned short mem_addr,unsigned short length,unsigned char*data)
{
    unsigned char tmp[2];

    if (!data)
	return -1;
    if (!st.chip_cfg.sensors)
	return -1;

    tmp[0] = (unsigned char) (mem_addr >> 8);
    tmp[1] = (unsigned char) (mem_addr & 0xFF);

    /* Check bank boundaries. */
    if (tmp[1] + length > st.hw->bank_size)
	return -1;

    if (i2c_write (st.hw->addr, st.reg->bank_sel, 2, tmp))
	return -1;
    if (i2c_write (st.hw->addr, st.reg->mem_r_w, length, data))
	return -1;
    return 0;
}

/**
 *  @brief      Read from the DMP memory.
 *  This function prevents I2C reads past the bank boundaries. The DMP memory
 *  is only accessible when the chip is awake.
 *  @param[in]  mem_addr    Memory location (bank << 8 | start address)
 *  @param[in]  length      Number of bytes to read.
 *  @param[out] data        Bytes read from memory.
 *  @return     0 if successful.
 */
int mpu_read_mem (unsigned short mem_addr,unsigned short length,unsigned char*data)
{
    unsigned char tmp[2];

    if (!data)
	return -1;
    if (!st.chip_cfg.sensors)
	return -1;

    tmp[0] = (unsigned char) (mem_addr >> 8);
    tmp[1] = (unsigned char) (mem_addr & 0xFF);

    /* Check bank boundaries. */
    if (tmp[1] + length > st.hw->bank_size)
	return -1;

    if (i2c_write (st.hw->addr, st.reg->bank_sel, 2, tmp))
	return -1;
    if (i2c_read (st.hw->addr, st.reg->mem_r_w, length, data))
	return -1;
    return 0;
}

/**
 *  @brief      Load and verify DMP image.
 *  @param[in]  length      Length of DMP image.
 *  @param[in]  firmware    DMP code.
 *  @param[in]  start_addr  Starting address of DMP code memory.
 *  @param[in]  sample_rate Fixed sampling rate used when DMP is enabled.
 *  @return     0 if successful.
 */
int mpu_load_firmware (unsigned short length,const unsigned char*firmware,unsigned short start_addr,unsigned short sample_rate)
{
    unsigned short ii;
    unsigned short this_write;
    /* Must divide evenly into st.hw->bank_size to avoid bank crossings. */
#define LOAD_CHUNK  (16)
    unsigned char cur[LOAD_CHUNK], tmp[2];

    if (st.chip_cfg.dmp_loaded)
	/* DMP should only be loaded once. */
	return -1;

