Neo-Du/Stm32F429IGT6_Learning/28_MPU9250/Drivers/BSP/eMPL/inv_mpu.c
    if (!firmware)
	return -1;
    for (ii = 0; ii < length; ii += this_write)
    {
	this_write = min(LOAD_CHUNK, length - ii);
	if (mpu_write_mem (ii, this_write, (unsigned char*) &firmware[ii]))
	    return -1;
	if (mpu_read_mem (ii, this_write, cur))
	    return -1;
	if (memcmp (firmware + ii, cur, this_write))
	    return -2;
    }

    /* Set program start address. */
    tmp[0] = start_addr >> 8;
    tmp[1] = start_addr & 0xFF;
    if (i2c_write (st.hw->addr, st.reg->prgm_start_h, 2, tmp))
	return -1;

    st.chip_cfg.dmp_loaded = 1;
    st.chip_cfg.dmp_sample_rate = sample_rate;
    return 0;
}

/**
 *  @brief      Enable/disable DMP support.
 *  @param[in]  enable  1 to turn on the DMP.
 *  @return     0 if successful.
 */
int mpu_set_dmp_state (unsigned char enable)
{
    unsigned char tmp;
    if (st.chip_cfg.dmp_on == enable)
	return 0;

    if (enable)
    {
	if (!st.chip_cfg.dmp_loaded)
	    return -1;
	/* Disable data ready interrupt. */
	set_int_enable (0);
	/* Disable bypass mode. */
	mpu_set_bypass (0);
	/* Keep constant sample rate, FIFO rate controlled by DMP. */
	mpu_set_sample_rate (st.chip_cfg.dmp_sample_rate);
	/* Remove FIFO elements. */
	tmp = 0;
	i2c_write (st.hw->addr, 0x23, 1, &tmp);
	st.chip_cfg.dmp_on = 1;
	/* Enable DMP interrupt. */
	set_int_enable (1);
	mpu_reset_fifo ();
    }
    else
    {
	/* Disable DMP interrupt. */
	set_int_enable (0);
	/* Restore FIFO settings. */
	tmp = st.chip_cfg.fifo_enable;
	i2c_write (st.hw->addr, 0x23, 1, &tmp);
	st.chip_cfg.dmp_on = 0;
	mpu_reset_fifo ();
    }
    return 0;
}

/**
 *  @brief      Get DMP state.
 *  @param[out] enabled 1 if enabled.
 *  @return     0 if successful.
 */
int mpu_get_dmp_state (unsigned char*enabled)
{
    enabled[0] = st.chip_cfg.dmp_on;
    return 0;
}

#ifdef AK89xx_SECONDARY
/* This initialization is similar to the one in ak8975.c. */
static int setup_compass (void)
{
    unsigned char data[4], akm_addr;

    mpu_set_bypass (1);

    /* Find compass. Possible addresses range from 0x0C to 0x0F. */
    for (akm_addr = 0x0C; akm_addr <= 0x0F; akm_addr++)
    {
	int result;
	result = i2c_read (akm_addr, AKM_REG_WHOAMI, 1, data);
	if (!result && (data[0] == AKM_WHOAMI))
	    break;
    }

    if (akm_addr > 0x0F)
    {
	/* TODO: Handle this case in all compass-related functions. */
	log_e ("Compass not found.\n");
	return -1;
    }

    st.chip_cfg.compass_addr = akm_addr;

    data[0] = AKM_POWER_DOWN;
    if (i2c_write (st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, data))
	return -1;
    delay_ms (1);

    data[0] = AKM_FUSE_ROM_ACCESS;
    if (i2c_write (st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, data))
	return -1;
    delay_ms (1);

    /* Get sensitivity adjustment data from fuse ROM. */
    if (i2c_read (st.chip_cfg.compass_addr, AKM_REG_ASAX, 3, data))
	return -1;
    st.chip_cfg.mag_sens_adj[0] = (long) data[0] + 128;
    st.chip_cfg.mag_sens_adj[1] = (long) data[1] + 128;
    st.chip_cfg.mag_sens_adj[2] = (long) data[2] + 128;

    data[0] = AKM_POWER_DOWN;
    if (i2c_write (st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, data))
	return -1;
    delay_ms (1);

    mpu_set_bypass (0);

    /* Set up master mode, master clock, and ES bit. */
    data[0] = 0x40;
    if (i2c_write (st.hw->addr, st.reg->i2c_mst, 1, data))
	return -1;

    /* Slave 0 reads from AKM data registers. */
    data[0] = BIT_I2C_READ | st.chip_cfg.compass_addr;
    if (i2c_write (st.hw->addr, st.reg->s0_addr, 1, data))
	return -1;

    /* Compass reads start at this register. */
    data[0] = AKM_REG_ST1;
    if (i2c_write (st.hw->addr, st.reg->s0_reg, 1, data))
	return -1;

    /* Enable slave 0, 8-byte reads. */
    data[0] = BIT_SLAVE_EN | 8;
    if (i2c_write (st.hw->addr, st.reg->s0_ctrl, 1, data))
	return -1;

    /* Slave 1 changes AKM measurement mode. */
    data[0] = st.chip_cfg.compass_addr;
    if (i2c_write (st.hw->addr, st.reg->s1_addr, 1, data))
	return -1;

    /* AKM measurement mode register. */
    data[0] = AKM_REG_CNTL;
    if (i2c_write (st.hw->addr, st.reg->s1_reg, 1, data))
	return -1;

    /* Enable slave 1, 1-byte writes. */
    data[0] = BIT_SLAVE_EN | 1;
    if (i2c_write (st.hw->addr, st.reg->s1_ctrl, 1, data))
	return -1;

    /* Set slave 1 data. */
    data[0] = AKM_SINGLE_MEASUREMENT;
    if (i2c_write (st.hw->addr, st.reg->s1_do, 1, data))
	return -1;

    /* Trigger slave 0 and slave 1 actions at each sample. */
    data[0] = 0x03;
    if (i2c_write (st.hw->addr, st.reg->i2c_delay_ctrl, 1, data))
	return -1;

#ifdef MPU9150
    /* For the MPU9150, the auxiliary I2C bus needs to be set to VDD. */
    data[0] = BIT_I2C_MST_VDDIO;
    if (i2c_write(st.hw->addr, st.reg->yg_offs_tc, 1, data))
        return -1;
#endif

    return 0;
}
#endif

/**
 *  @brief      Read raw compass data.
 *  @param[out] data        Raw data in hardware units.
 *  @param[out] timestamp   Timestamp in milliseconds. Null if not needed.
 *  @return     0 if successful.
 */
int mpu_get_compass_reg (short*data,unsigned long*timestamp)
{
#ifdef AK89xx_SECONDARY
    unsigned char tmp[9];

    if (!(st.chip_cfg.sensors & INV_XYZ_COMPASS))
	return -1;

#ifdef AK89xx_BYPASS
    if (i2c_read(st.chip_cfg.compass_addr, AKM_REG_ST1, 8, tmp))
        return -1;
    tmp[8] = AKM_SINGLE_MEASUREMENT;
    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, tmp+8))
        return -1;
#else
    if (i2c_read (st.hw->addr, st.reg->raw_compass, 8, tmp))
	return -1;
#endif

#if defined AK8975_SECONDARY
    /* AK8975 doesn't have the overrun error bit. */
    if (!(tmp[0] & AKM_DATA_READY))
        return -2;
    if ((tmp[7] & AKM_OVERFLOW) || (tmp[7] & AKM_DATA_ERROR))
        return -3;
#elif defined AK8963_SECONDARY
    /* AK8963 doesn't have the data read error bit. */
    if (!(tmp[0] & AKM_DATA_READY) || (tmp[0] & AKM_DATA_OVERRUN))
	return -2;
    if (tmp[7] & AKM_OVERFLOW)
	return -3;
#endif
    data[0] = (tmp[2] << 8) | tmp[1];
    data[1] = (tmp[4] << 8) | tmp[3];
    data[2] = (tmp[6] << 8) | tmp[5];

    data[0] = ((long) data[0] * st.chip_cfg.mag_sens_adj[0]) >> 8;
    data[1] = ((long) data[1] * st.chip_cfg.mag_sens_adj[1]) >> 8;
    data[2] = ((long) data[2] * st.chip_cfg.mag_sens_adj[2]) >> 8;

    if (timestamp)
	get_ms (timestamp);
    return 0;
#else
    return -1;
#endif
}

/**
 *  @brief      Get the compass full-scale range.
 *  @param[out] fsr Current full-scale range.
 *  @return     0 if successful.
 */
int mpu_get_compass_fsr (unsigned short*fsr)
{
#ifdef AK89xx_SECONDARY
    fsr[0] = st.hw->compass_fsr;
    return 0;
#else
    return -1;
#endif
}

/**
 *  @brief      Enters LP accel motion interrupt mode.
 *  The behaviour of this feature is very different between the MPU6050 and the
 *  MPU6500. Each chip's version of this feature is explained below.
 *
 *  \n The hardware motion threshold can be between 32mg and 8160mg in 32mg
 *  increments.
 *
 *  \n Low-power accel mode supports the following frequencies:
 *  \n 1.25Hz, 5Hz, 20Hz, 40Hz
 *
 *  \n MPU6500:
 *  \n Unlike the MPU6050 version, the hardware does not "lock in" a reference
 *  sample. The hardware monitors the accel data and detects any large change
 *  over a short period of time.
 *
 *  \n The hardware motion threshold can be between 4mg and 1020mg in 4mg
 *  increments.
 *
 *  \n MPU6500 Low-power accel mode supports the following frequencies:
 *  \n 1.25Hz, 2.5Hz, 5Hz, 10Hz, 20Hz, 40Hz, 80Hz, 160Hz, 320Hz, 640Hz
 *
 *  \n\n NOTES:
 *  \n The driver will round down @e thresh to the nearest supported value if
 *  an unsupported threshold is selected.
 *  \n To select a fractional wake-up frequency, round down the value passed to
 *  @e lpa_freq.
 *  \n The MPU6500 does not support a delay parameter. If this function is used
 *  for the MPU6500, the value passed to @e time will be ignored.
 *  \n To disable this mode, set @e lpa_freq to zero. The driver will restore
 *  the previous configuration.
 *
 *  @param[in]  thresh      Motion threshold in mg.
 *  @param[in]  time        Duration in milliseconds that the accel data must
 *                          exceed @e thresh before motion is reported.
 *  @param[in]  lpa_freq    Minimum sampling rate, or zero to disable.
 *  @return     0 if successful.
 */
int mpu_lp_motion_interrupt (unsigned short thresh,unsigned char time,unsigned short lpa_freq)
{

#if defined MPU6500
    unsigned char data[3];
#endif
    if (lpa_freq)
    {
#if defined MPU6500
	unsigned char thresh_hw;

	/* 1LSb = 4mg. */
	if (thresh > 1020)
	    thresh_hw = 255;
	else if (thresh < 4)
	    thresh_hw = 1;
	else
	    thresh_hw = thresh >> 2;
#endif

	if (!time)
	    /* Minimum duration must be 1ms. */
	    time = 1;

#if defined MPU6500
	if (lpa_freq > 640)
	    /* At this point, the chip has not been re-configured, so the
	     * function can safely exit.
	     */
	    return -1;
#endif

	if (!st.chip_cfg.int_motion_only)
	{
	    /* Store current settings for later. */
	    if (st.chip_cfg.dmp_on)
	    {
		mpu_set_dmp_state (0);
		st.chip_cfg.cache.dmp_on = 1;
	    }
	    else
		st.chip_cfg.cache.dmp_on = 0;
	    mpu_get_gyro_fsr (&st.chip_cfg.cache.gyro_fsr);
	    mpu_get_accel_fsr (&st.chip_cfg.cache.accel_fsr);
	    mpu_get_lpf (&st.chip_cfg.cache.lpf);
	    mpu_get_sample_rate (&st.chip_cfg.cache.sample_rate);
	    st.chip_cfg.cache.sensors_on = st.chip_cfg.sensors;
	    mpu_get_fifo_config (&st.chip_cfg.cache.fifo_sensors);
	}

#if defined MPU6500
	/* Disable hardware interrupts. */
	set_int_enable (0);

